// src/data.ts

export type Category =
  | "человек-природа"
  | "человек-техника"
  | "человек-человек"
  | "человек-знаковые системы"
  | "человек-художественный образ";

export interface AnswerOption {
  text: string;
  category: Category;
}

export interface Question {
  answers: [AnswerOption, AnswerOption]; // по условию 2 ответа
}

export const questions: Question[] = [
 
  {
    answers: [
      { text: "Ухаживать за животными", category: "человек-природа" },
      { text: "Обслуживать машины, приборы (следить, регулировать)", category: "человек-техника" },
    ],
  },

  {
    answers: [
      { text: "Помогать больным людям, лечить их", category: "человек-человек" },
      { text: "Составлять таблицы, схемы, компьютерные программы", category: "человек-знаковые системы" },
    ],
  },

  {
    answers: [
      { text: "Следить за качеством книжных иллюстраций, плакатов, художественных открыток, рекламных рисунков, комик-сов.", category: "человек-художественный образ" },
      { text: "Следить за состоянием, развитием растений", category: "человек-природа" },
    ],
  },
  
  {
    answers: [
      { text: "Обрабатывать материалы (дерево, ткань, металл, пластик и т.п.)", category: "человек-техника" },
      { text: "Доводить товары для потребителя (рекламировать, продавать)", category: "человек-человек" },
    ],
  },
  
  {
    answers: [
      { text: "Обсуждать научно-популярные книги, статьи", category: "человек-знаковые системы" },
      { text: "Обсуждать художественные книги", category: "человек-художественный образ" },
    ],
  },
  
  {
    answers: [
      { text: "Выращивать молодняк – животных ка-кой-либо породы", category: "человек-природа" },
      { text: "Тренировать сверстников (или млад-ших) в выполнении каких-либо действий (трудовых, учебных, спортивных)", category: "человек-человек" },
    ],
  },
  
  {
    answers: [
      { text: "Копировать рисунки, изображения; настраивать музыкальные инструменты ", category: "человек-художественный образ" },
      { text: "Управлять каким-либо грузовым, подъёмным, транспортным средством (подъёмным краном, трактором, тепловозом и др.)", category: "человек-техника" },
    ],
  },
  
  {
    answers: [
      { text: "Сообщать, разъяснять людям нужные им сведения  (на ресепшен, на экскурсии и т.п.)", category: "человек-человек" },
      { text: "Художественно оформлять выставки, витрины; участвовать в подготовке пьес, концертов (достаточно одно)", category: "человек-художественный образ" },
    ],
  },
  
  {
    answers: [
      { text: "Ремонтировать изделия, вещи (одежду, технику), жилище", category: "человек-техника" },
      { text: "Искать и исправлять ошибки в текстах, таблицах, рисунках", category: "человек-знаковые системы" },
    ],
  },
  
  {
    answers: [
      { text: "Лечить животных", category: "человек-природа" },
      { text: "Выполнять вычисления, расчёты", category: "человек-знаковые системы" },
    ],
  },
  
  {
    answers: [
      { text: "Выводить новые сорта растений", category: "человек-природа" },
      { text: "Конструировать, моделировать, проектировать новые виды промышленных изделий (машины, одежду, дома, продукты питания, роботы)", category: "человек-техника" },
    ],
  },
  
  {
    answers: [
      { text: "Разбирать споры, ссоры между людьми, убеждать, разъяснять, поощрять, наказывать", category: "человек-человек" },
      { text: "Разбираться в чертежах, схемах, таблицах (проверять, уточнять, приводить в порядок)", category: "человек-знаковые системы" },
    ],
  },
  
  {
    answers: [
      { text: "Наблюдать и изучать работу кружков художественной самодеятельности (танцевальных, музыкальных, КВН и т.п.)", category: "человек-художественный образ" },
      { text: "Наблюдать, изучать жизнь микробов", category: "человек-природа" },
    ],
  },
  
  {
    answers: [
      { text: "Обслуживать, налаживать медицинские приборы и аппараты", category: "человек-техника" },
      { text: "Оказывать людям медицинскую по-мощь при ранениях, ушибах, ожогах и т.п.)", category: "человек-человек" },
    ],
  },
  
  {
    answers: [
      { text: "Составлять точные описания (отчёты) о наблюдаемых явлениях, событиях, из-меряемых объектах и др.", category: "человек-знаковые системы" },
      { text: "Художественно описывать, изображать события, наблюдаемые или представля-емые", category: "человек-художественный образ" },
    ],
  },
  
  {
    answers: [
      { text: "Делать лабораторные анализы в больнице", category: "человек-природа" },
      { text: "Принимать, осматривать больных, беседовать с ними, назначать лечение", category: "человек-человек" },
    ],
  },
  
  {
    answers: [
      { text: "Красить или расписывать стены помещений, поверхность изделий", category: "человек-художественный образ" },
      { text: "Осуществлять монтаж здания или сборку машин, приборов", category: "человек-техника" },
    ],
  },
  
  {
    answers: [
      { text: "Организовывать культпоходы сверстников или младших товарищей в теат-ры, музеи, на экскурсии, в туристические походы и т.п.", category: "человек-человек" },
      { text: "Играть на сцене, принимать участие в концертах", category: "человек-художественный образ" },
    ],
  },
  
  {
    answers: [
      { text: "Изготавливать по чертежам детали, из-делия (машины, одежду), строить зда-ния", category: "человек-техника" },
      { text: "Заниматься черчением, копировать чертежи, карты, составлять схемы, таб-лицы", category: "человек-знаковые системы" },
    ],
  },
  
  {
    answers: [
      { text: "Вести борьбу с болезнями растений, с вредителями леса, сада", category: "человек-природа" },
      { text: "Работать на клавишных машинах (компьютерной клавиатуре, телетайпе, наборной машине и др.)", category: "человек-знаковые системы" },
    ],
  },
  

];
